Przygotowywanie danych

In [2]:
# Wczytanie biblioteki.
import pandas as pd

In [3]:
# Utworzenie adresu URL.
url = 'https://raw.githubusercontent.com/chrisalbon/sim_data/master/titanic.csv'

# Umieszczenie wczytanych informacji w ramce danych.
dataframe = pd.read_csv(url)

# Wyświetlenie pierwszych pięciu wierszy.
dataframe.head(10)

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0
5,"Anderson, Mr Harry",1st,47.00,male,1,0
6,"Andrews, Miss Kornelia Theodosia",1st,63.00,female,1,1
7,"Andrews, Mr Thomas, jr",1st,39.00,male,0,0
8,"Appleton, Mrs Edward Dale (Charlotte Lamson)",1st,58.00,female,1,1
9,"Artagaveytia, Mr Ramon",1st,71.00,male,0,0

Stowrzymy teraz ramkę danych

In [4]:

# Utworzenie słownika. Zauważmy, że klucze słownika będą nazwami kolumn w ramce
dictionary = {
    "Name": ['Jacky Jackson', 'Steven Stevenson'],
    "Age": [38, 25],
    "Driver": [True, False]
}

# Utworzenie obiektu typu DataFrame.
dataframe = pd.DataFrame(dictionary)

# Wyświetlenie obiektu DataFrame.
dataframe

               Name  Age  Driver
0     Jacky Jackson   38    True
1  Steven Stevenson   25   False

In [5]:
# Dodanie kolumny opisującej kolor oczu.
dataframe["Eyes"] = ["Brown", "Blue"]

# Wyświetlenie obiektu DataFrame.
dataframe

               Name  Age  Driver   Eyes
0     Jacky Jackson   38    True  Brown
1  Steven Stevenson   25   False   Blue

Teraz zajmijmy się opisywaniem danych

In [3]:
# Utworzenie adresu URL.
url = 'https://raw.githubusercontent.com/chrisalbon/sim_data/master/titanic.csv'

# Wczytanie danych.
dataframe = pd.read_csv(url)

# Wyświetlenie dwóch pierwszych wierszy.
dataframe.head(2)

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1

In [4]:
# Wyświetlenie wielkości danych.
dataframe.shape

#Pierwszą wartością tego tuples jest liczba wierszy(rekordów), a drugą jest ilość cech(kolumn)
#UWAGA: liczba porządkowa nie jest wliczana do ilości cech

(1313, 6)

In [5]:
# Wyświetlenie pewnych danych statystycznych.
dataframe.describe()

              Age     Survived      SexCode
count  756.000000  1313.000000  1313.000000
mean    30.397989     0.342727     0.351866
std     14.259049     0.474802     0.477734
min      0.170000     0.000000     0.000000
25%     21.000000     0.000000     0.000000
50%     28.000000     0.000000     0.000000
75%     39.000000     1.000000     1.000000
max     71.000000     1.000000     1.000000

In [6]:
# Wyświetlenie informacji.
dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1313 entries, 0 to 1312
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      1313 non-null   object
 1   PClass    1313 non-null   object
 2   Age       756 non-null    float64
 3   Sex       1313 non-null   object
 4   Survived  1313 non-null   int64
 5   SexCode   1313 non-null   int64
dtypes: float64(1), int64(2), object(3)
memory usage: 61.7+ KB

Poruszanie się po ramce danych

In [1]:
# Wczytanie biblioteki.
import pandas as pd

# Utworzenie adresu URL.
url = 'https://raw.githubusercontent.com/chrisalbon/sim_data/master/titanic.csv'

# Wczytanie danych.
dataframe = pd.read_csv(url)

# Pobranie pierwszego wiersza.
dataframe.iloc[0]

Name        Allen, Miss Elisabeth Walton
PClass                               1st
Age                                 29.0
Sex                               female
Survived                               1
SexCode                                1
Name: 0, dtype: object

Pobieranie na podstawie warunków

In [2]:
# Wczytanie biblioteki.
import pandas as pd

# Utworzenie adresu URL.
url = 'https://raw.githubusercontent.com/chrisalbon/sim_data/master/titanic.csv'

# Wczytanie danych.
dataframe = pd.read_csv(url)

# Wyświetlenie dwóch pierwszych wierszy, w których kolumna 'Sex' ma wartość 'female'.
dataframe[dataframe['Sex'] == 'female'].head(2)

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1

In [4]:
#Weźmy bardziej skomplikowany warunek

# Filtrowanie wierszy.
dataframe[(dataframe['Sex'] == 'female') & (dataframe['Age'] >= 65)].head(5)

,Name,PClass,Age,Sex,Survived,SexCode
73,"Crosby, Mrs Edward Gifford (Catherine Elizabet...",1st,69.0,female,1,1

Teraz zjmijmy się problemem sortowania

In [6]:
# Wczytanie biblioteki.
import pandas as pd

# Utworzenie adresu URL.
url = 'https://raw.githubusercontent.com/chrisalbon/sim_data/master/titanic.csv'

# Wczytanie danych.
dataframe = pd.read_csv(url)

# Sortowanie ramki danych według kolumny Age i wyświetlenie dwóch pierwszych wierszy.
dataframe.sort_values(by=["Age"]).head(2)

,Name,PClass,Age,Sex,Survived,SexCode
763,"Dean, Miss Elizabeth Gladys (Millvena)",3rd,0.17,female,1,1
751,"Danbom, Master Gilbert Sigvard Emanuel",3rd,0.33,male,0,0

Teraz zajmijmy się problemem zastępowania

In [7]:
# Wczytanie biblioteki.
import pandas as pd

# Utworzenie adresu URL.
url = 'https://raw.githubusercontent.com/chrisalbon/sim_data/master/titanic.csv'

# Wczytanie danych.
dataframe = pd.read_csv(url)

# Zastąpienie wartości, wyświetlenie pięciu pierwszych wierszy.
dataframe['Sex'].replace("female", "Woman").head(5)

0    Woman
1    Woman
2     male
3    Woman
4     male
Name: Sex, dtype: object

In [8]:
# Zastąpienie słów "female" i "male" słowami "Woman" i "Man".
dataframe['Sex'].replace(["female", "male"], ["Woman", "Man"]).head(5)

0    Woman
1    Woman
2      Man
3    Woman
4      Man
Name: Sex, dtype: object

In [9]:
# Zastąpienie wartości w całej ramce, wyświetlenie dwóch pierwszych wierszy.
dataframe.replace(1, "One").head(2)

                           Name PClass   Age     Sex Survived SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female      One     One
1   Allison, Miss Helen Loraine    1st   2.0  female        0     One

In [10]:
#Zastąpienie wartości, wyświetlenie dwóch pierwszych wierszy.
dataframe.replace(r"1st", "First", regex=True).head(2)

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton  First  29.0  female         1        1
1   Allison, Miss Helen Loraine  First   2.0  female         0        1

# Teraz zajmiemy się zmianą nazw kolum

In [11]:
# Wczytanie biblioteki.
import pandas as pd

# Utworzenie adresu URL.
url = 'https://raw.githubusercontent.com/chrisalbon/sim_data/master/titanic.csv'

# Wczytanie danych.
dataframe = pd.read_csv(url)

In [12]:
dataframe

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0
...,...,...,...,...,...,...
1308,"Zakarian, Mr Artun",3rd,27.00,male,0,0
1309,"Zakarian, Mr Maprieder",3rd,26.00,male,0,0
1310,"Zenni, Mr Philip",3rd,22.00,male,0,0
1311,"Lievens, Mr Rene",3rd,24.00,male,0,0
1312,"Zimmerman, Leo",3rd,29.00,male,0,0

In [14]:
#Zmiana nazw kilku kolumn. Zauważmy, że dokonujemy zmiany orzy pomocy słownika, gdzie kluczem są stare nazwy kolumn a wartościami nowe nazwy
dataframe.rename(columns={'PClass': 'Passenger Class', 'Sex': 'Gender'}).head(2)

,Name,Passenger Class,Age,Gender,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1

Przypuśćmy, że chcemy zmienić nazwy wszystkich kolumn.
Stwórzmy w "czarno-magiczny" sposób teraz słownik z kluczami będącymi nazwami kolumn, oraz wartościami jako puste ciągi znaków

In [17]:
# Wczytanie biblioteki.
import collections

# Utworzenie słownika.
column_names = collections.defaultdict(str)

# Utworzenie kluczy.
for name in dataframe.columns:
    column_names[name]
    #Tutaj fajnie byłoby walnąć jednolinijkowego fora

In [18]:
# Wyświetlenie słownika.
column_names

defaultdict(str,
            {'Name': '',
             'PClass': '',
             'Age': '',
             'Sex': '',
             'Survived': '',
             'SexCode': ''})

Znajdywanie wartości min, maks itp.

In [1]:
# Wczytanie biblioteki.
import pandas as pd

# Utworzenie adresu URL.
url = 'https://raw.githubusercontent.com/chrisalbon/sim_data/master/titanic.csv'

# Wczytanie danych.
dataframe = pd.read_csv(url)

In [2]:
# Obliczenie danych statystycznych.
print('Analiza kolumny Age')
print('Maksimum:', dataframe['Age'].max())
print('Minimum:', dataframe['Age'].min())
print('Średnia:', dataframe['Age'].mean())
print('Suma:', dataframe['Age'].sum())
print('Liczba elementów:', dataframe['Age'].count())

Analiza kolumny Age
Maksimum: 71.0
Minimum: 0.17
Średnia: 30.397989417989418
Suma: 22980.88
Liczba elementów: 756

In [3]:
# Wyświetlenie liczby elementów w kolumnach.
dataframe.count()

Name        1313
PClass      1313
Age          756
Sex         1313
Survived    1313
SexCode     1313
dtype: int64

Wartości unikatowe. Operacja na wartościach(usuwanie, grupowanie)

In [4]:
# Wczytanie biblioteki.
import pandas as pd

# Utworzenie adresu URL.
url = 'https://raw.githubusercontent.com/chrisalbon/sim_data/master/titanic.csv'

# Wczytanie danych.
dataframe = pd.read_csv(url)

In [5]:
# Pobranie unikatowych wartości.
dataframe['Sex'].unique()

array(['female', 'male'], dtype=object)

In [6]:

# Wyświetlenie liczby elementów w kolumnach.
dataframe['Sex'].value_counts()

Sex
male      851
female    462
Name: count, dtype: int64

In [7]:
# Wyświetlenie liczby elementów w kolumnach.
dataframe['PClass'].value_counts()

PClass
3rd    711
1st    322
2nd    279
*        1
Name: count, dtype: int64

In [8]:
# Wyświetlenie liczby unikatowych wartości.
dataframe['PClass'].nunique()

4

In [9]:
# Pobranie i wyświetlenie dwóch wierszy, w których brakuje wartości.
dataframe[dataframe['Age'].isnull()].head(2)

                            Name PClass  Age     Sex  Survived  SexCode
12  Aubert, Mrs Leontine Pauline    1st  NaN  female         1        1
13      Barkworth, Mr Algernon H    1st  NaN    male         1        0

In [10]:
# Próba zastąpienia wartości przez NaN.
dataframe['Sex'] = dataframe['Sex'].replace('male', NaN)

NameError: name 'NaN' is not defined

In [12]:
# Wczytanie biblioteki.
import numpy as np

# Zastąpienie wartości przez NaN. Trzeba urzyć obiektu z modułu numpy
dataframe['Sex'] = dataframe['Sex'].replace('male', np.nan)

In [14]:
# Wczytanie danych, przypisanie brakujących wartości. Każda wartość z listy podanej jako argument dla na_values zostanie wczytana jako NaN
dataframe = pd.read_csv(url, na_values=[np.nan, 'NONE', -999])

In [21]:
# Usunięcie kolumny.
dataframe=dataframe.drop('Age', axis=1)

In [22]:
dataframe.head(5)

,Name,PClass,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,female,1,1
1,"Allison, Miss Helen Loraine",1st,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,female,0,1
4,"Allison, Master Hudson Trevor",1st,male,1,0

In [23]:
# Usunięcie kolumn. Jak już nie ma takiej kolumny to się nie da usunąć(logiczne)
dataframe.drop(['Age', 'Sex'], axis=1).head(2)

KeyError: "['Age'] not found in axis"

In [24]:
# Utworzenie nowego obiektu typu DataFrame.
dataframe_name_dropped = dataframe.drop(dataframe.columns[0], axis=1)

In [25]:
dataframe_name_dropped

     PClass     Sex  Survived  SexCode
0       1st  female         1        1
1       1st  female         0        1
2       1st    male         0        0
3       1st  female         0        1
4       1st    male         1        0
...     ...     ...       ...      ...
1308    3rd    male         0        0
1309    3rd    male         0        0
1310    3rd    male         0        0
1311    3rd    male         0        0
1312    3rd    male         0        0

[1313 rows x 4 columns]

In [28]:
#Nie jest zalecane, ale można zmodyfikować ramkę w miejscu. Zaleca się jednak(m.in. przez skąplikowane protokoły przetwarzania danych). Czyli ramki trktujemyu jako coś sztywnego
dataframe.drop(dataframe.columns[0],axis=1,inplace=True)

In [29]:
dataframe

         Sex  Survived  SexCode
0     female         1        1
1     female         0        1
2       male         0        0
3     female         0        1
4       male         1        0
...      ...       ...      ...
1308    male         0        0
1309    male         0        0
1310    male         0        0
1311    male         0        0
1312    male         0        0

[1313 rows x 3 columns]

In [30]:
# Wczytanie biblioteki.
import pandas as pd

# Utworzenie adresu URL.
url = 'https://raw.githubusercontent.com/chrisalbon/sim_data/master/titanic.csv'

# Wczytanie danych.
dataframe = pd.read_csv(url)

In [32]:
# Wyświetlenie trzech pierwszych wierszy danych wyjściowych, gdzie płeć jest różna od male
dataframe[dataframe['Sex'] != 'male'].head(3)

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1

In [34]:
# Usunięcie wiersza poprzez podanie jego indeksu, wyświetlenie dwóch pierwszych wierszy danych wyjściowych. Formalnie można usuwac wiersze przy pomocy drop ale zauważmy, że 
# wykorzystując wyrażenia boolowskie mamy dostęp do dużo większej ilości operacji(nie musimy szukać wierszy spełniających określone reguły a potem je usuwać, tylko od razu mamy wklepane reguły)
dataframe[dataframe.index != 0].head(2)

                                  Name PClass   Age     Sex  Survived  SexCode
1          Allison, Miss Helen Loraine    1st   2.0  female         0        1
2  Allison, Mr Hudson Joshua Creighton    1st  30.0    male         0        0

In [35]:
# Usunięcie powielonych wierszy, wyświetlenie dwóch pierwszych wierszy danych wyjściowych.
# Wyświetlenie liczby wierszy.
print("Liczba wierszy w początkowym obiekcie DataFrame:", len(dataframe))
print("Liczba wierszy po przeprowadzeniu operacji:", len(dataframe.drop_duplicates()))

Liczba wierszy w początkowym obiekcie DataFrame: 1313
Liczba wierszy po przeprowadzeniu operacji: 1313

In [48]:
dataframe.iloc[0]

Name        Allen, Miss Elisabeth Walton
PClass                               1st
Age                                 29.0
Sex                               female
Survived                               1
SexCode                                1
Name: 0, dtype: object

In [54]:
#Wniosek:wszytkie wiersze są unikatowe. 
#Wykonajmy teraz eksperyment

dataframe_name_add = pd.DataFrame
dataframe_name_add = dataframe
#Dodanie wiersza w celu uzyskania dubli

row = dataframe.iloc[0]

row.head(1)

Name    Allen, Miss Elisabeth Walton
Name: 0, dtype: object

In [55]:
#Weźmy usuwanie wartości powielających się w obrębie jednej kolumny
# Usunięcie powielonych wierszy.
dataframe.drop_duplicates(subset=['Sex'])

                                  Name PClass   Age     Sex  Survived  SexCode
0         Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
2  Allison, Mr Hudson Joshua Creighton    1st  30.0    male         0        0

In [56]:
#Funkcja ta usuwa wszystkie następne napotkane duble. Można urzyć fukcji która jedynie wskaże, czy wiersz sie powtórzy 
dataframe.duplicated()

0       False
1       False
2       False
3       False
4       False
        ...
1308    False
1309    False
1310    False
1311    False
1312    False
Length: 1313, dtype: bool

Grupowanie wierszy

In [57]:
# Wczytanie biblioteki.
import pandas as pd

# Utworzenie adresu URL.
url = 'https://raw.githubusercontent.com/chrisalbon/sim_data/master/titanic.csv'

# Wczytanie danych.
dataframe = pd.read_csv(url)

In [58]:
# Grupowanie wierszy według wartości kolumny 'Sex'
# i obliczenie średniej w poszczególnych grupach.
dataframe.groupby('Sex').mean(numeric_only=True)

              Age  Survived  SexCode
Sex
female  29.396424  0.666667      1.0
male    31.014338  0.166863      0.0

In [59]:
# Grupowanie wierszy, a następnie ich zliczenie.
dataframe.groupby('Survived')['Name'].count()

Survived
0    863
1    450
Name: Name, dtype: int64

In [60]:
# Grupowanie wierszy, obliczenie średniej.
dataframe.groupby(['Sex','Survived'])['Age'].mean()

Sex     Survived
female  0           24.901408
        1           30.867143
male    0           32.320780
        1           25.951875
Name: Age, dtype: float64

# UWAGA!
groupby musi być wywołane z jakąś funkcją agregującą

# Grupowanie według czasu

In [61]:
# Wczytanie bibliotek.
import pandas as pd
import numpy as np

# Utworzenie przedziału czasu.
time_index = pd.date_range('06/06/2017', periods=100000, freq='30S')

# Utworzenie obiektu typu DataFrame.
dataframe = pd.DataFrame(index=time_index)

# Utworzenie kolumny losowo wybranych wartości.
dataframe['Sale_Amount'] = np.random.randint(1, 10, 100000)

# Grupowanie wierszy według tygodnia, obliczenie sumy dla danego tygodnia.
dataframe.resample('W').sum()

C:\Users\claud\AppData\Local\Temp\ipykernel_19644\3591089753.py:6: FutureWarning: 'S' is deprecated and will be removed in a future version, please use 's' instead.
  time_index = pd.date_range('06/06/2017', periods=100000, freq='30S')

            Sale_Amount
2017-06-11        86315
2017-06-18       100705
2017-06-25       101005
2017-07-02       101114
2017-07-09       100837
2017-07-16        10329

In [63]:
dataframe.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 100000 entries, 2017-06-06 00:00:00 to 2017-07-10 17:19:30
Freq: 30s
Data columns (total 1 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   Sale_Amount  100000 non-null  int32
dtypes: int32(1)
memory usage: 1.1 MB

In [64]:
#Więcej alisaów związanych z czsem dla bibloteki pandas: https://pandas.pydata.org/docs/user_guide/timeseries.html

# Agregowanie operacji statystycznych

In [65]:
# Wczytanie biblioteki.
import pandas as pd

# Utworzenie adresu URL.
url = 'https://raw.githubusercontent.com/chrisalbon/sim_data/master/titanic.csv'

# Wczytanie danych.
dataframe = pd.read_csv(url)

In [66]:
# Pobranie wartości minimalnej każdej kolumny.
dataframe.agg("min")

Name        Abbing, Mr Anthony
PClass                       *
Age                       0.17
Sex                     female
Survived                     0
SexCode                      0
dtype: object

In [67]:
# Wartość średnia kolumny Age oraz wartości minimalna i maksymalna kolumny Sex.
dataframe.agg({"Age":["mean"], "SexCode":["min", "max"]})

            Age  SexCode
mean  30.397989      NaN
min         NaN      0.0
max         NaN      1.0

In [68]:
# Liczba pasażerów w poszczególnych klasach, którzy przeżyli i nie przeżyli katastrofy Titanica.
dataframe.groupby(
    ["PClass","Survived"]).agg({"Survived":["count"]}
  ).reset_index()

  PClass Survived
                  count
0      *        0     1
1    1st        0   129
2    1st        1   193
3    2nd        0   160
4    2nd        1   119
5    3rd        0   573
6    3rd        1   138